USE mydb;
-- ЗАПРОС 1 --
-- Показывает тех, кто прямо сейчас держит книги на руках, и тех, кто вообще никогда не брал бумажные книги --
SELECT
    Читатель.ФИО,
    `Выдача бумажной версии`.`Дата выдачи`,
    `Выдача бумажной версии`.`Дата возврата`
FROM
    Читатель,
    `Выдача бумажной версии`
WHERE
    Читатель.Номер_читательского_билета =
    `Выдача бумажной версии`.Читатель_Номер_читательского_билета
    AND `Выдача бумажной версии`.`Дата возврата` IS NULL

UNION

SELECT
    Читатель.ФИО,
    'Нет бумажной выдачи',
    'Нет даты возврата'
FROM
    Читатель
WHERE
    Читатель.Номер_читательского_билета NOT IN
    (
        SELECT
            `Выдача бумажной версии`.Читатель_Номер_читательского_билета
        FROM
            `Выдача бумажной версии`
    );




-- ЗАПРОС 2 --
-- Показывает список читателей, которые брали электронные версии книг, изданных строго в 2021 году --
SELECT
    Читатель.ФИО AS 'Читатель',
    Книга.Название AS 'Книга',
    `Выдача электронной версии`.Книга_ISBN AS 'ISBN'
FROM
    Читатель,
    `Выдача электронной версии`,
    Книга
WHERE
    Читатель.Номер_читательского_билета =
    `Выдача электронной версии`.Читатель_Номер_читательского_билета
    AND Книга.ISBN =
    `Выдача электронной версии`.Книга_ISBN
    AND Книга.`Год_издания` = 2021
ORDER BY 2;




-- ЗАПРОС 3 --
-- История выдачи конкретных бумажных книг определенным читателям, отсортированная по году издания книг --
SELECT
    Читатель.ФИО AS 'Читатель',
    Книга.Название AS 'Книга',
    Книга.`Год_издания` AS 'Год издания',
    Экземпляр.Инвентарный_номер AS 'Инвентарный номер',
    `Выдача бумажной версии`.`Дата выдачи`,
    `Выдача бумажной версии`.`Дата возврата`
FROM
    Читатель,
    Книга,
    Экземпляр,
    `Выдача бумажной версии`
WHERE
    Читатель.Номер_читательского_билета =
    `Выдача бумажной версии`.Читатель_Номер_читательского_билета
    AND `Выдача бумажной версии`.Экземпляр_Инвентарный_номер =
    Экземпляр.Инвентарный_номер
    AND Экземпляр.Книга_ISBN = Книга.ISBN
    AND Экземпляр.Инвентарный_номер IN (1001, 1004, 1007, 1010)
ORDER BY
    Книга.`Год_издания`;






